app/controllers/art_infos_controller.rb

INSERT INTO "art_infos" ("key", "repo_path", "recurring", "degrade", "random", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["key", nil], ["repo_path", nil], ["recurring", nil], ["degrade", nil], ["random", nil], ["created_at", "2024-05-23 12:21:11.177688"], ["updated_at", "2024-05-23 12:21:11.177688"]]
---
  def create
    @art_info = ArtInfo.create(art_info_params)